# constants.py
import math

CONSTANTS = {
    # Механика
    "g": 9.81,                      # Ускорение свободного падения (м/с²)
    "G_grav": 6.67430e-11,          # Гравитационная постоянная (Н·м²/кг²)
    "M_earth": 5.97e24,             # Масса Земли (кг)
    "R_earth": 6.37e6,              # Радиус Земли (м)

    # Термодинамика и МКТ
    "R_univ": 8.314,                # Универсальная газовая постоянная (Дж/(моль·К))
    "k_boltzmann": 1.380649e-23,    # Постоянная Больцмана (Дж/К)
    "N_A": 6.022e23,                # Число Авогадро (1/моль)

    # Электродинамика и оптика
    "c_light": 299792458.0,         # Скорость света в вакууме (м/с)
    "q_e": 1.602176634e-19,         # Элементарный заряд (Кл)
    "эв": 1.602176634e-19,          # Элементарный заряд (Кл)
    "ev": 1.602176634e-19,          # Элементарный заряд (Кл)
    "m_e": 9.10938356e-31,          # Масса покоя электрона (кг)
    "k_coulomb": 8.98755e9,         # Коэффициент Кулона 1/(4*pi*eps0) (Н·м²/Кл²)

    # Квантовая физика
    "h": 6.62607015e-34,            # Постоянная Планка (Дж·с)
    "h_bar": 1.054571817e-34,       # Приведенная постоянная Планка (Дж·с)
    "e": 1.602176634e-19,
    "e_charge": 1.602176634e-19,    
    "нм": 1e-9,
    "nm": 1e-9,    

    # Математика
    "pi": math.pi,
}